public class Zadacha7 {
    public static void main(String[] args) {
        System.out.println("Задача 7"); // Напишите программу, которая выводит в консоль последовательность чисел:.
        for (int i = 1; i <= 512; i = i * 2) {
            System.out.print(i + " ");
        }
    }
}