public class Zadacha6 {
    public static void main(String[] args) {
        System.out.println("Задача 6"); // Напишите программу, которая выводит в консоль последовательность чисел:.
        for (int i = 7; i <= 98; i = i + 7) {
            System.out.print(i + " ");
        }
    }
}